name: "AlexNet"
input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 227
  dim: 227
}
layer {
  name: "PROGRAM1"
  type: "XCLProgram"
  xcl_name: "conv1_layer.xclbin"
  kernel_name: "conv1_layer"
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
  }
}
layer {
  name: "PROGRAM2"
  type: "XCLProgram"
  xcl_name: "relu_layer.xclbin"
  kernel_name: "relu_layer"
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "PROGRAM3"
  type: "XCLProgram"
  xcl_name: "pool1_max_layer.xclbin"
  kernel_name: "pool1_max_layer"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
