name: "AlexNet"
input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 227
  dim: 227
}
layer {
  name: "PROGRAM1"
  type: "XCLProgram"
  xcl_name: "pipeline_conv_pool_layer.xclbin"
  kernel_name: "conv1_layer"
  kernel_name_2: "pool1_max_layer"
}
layer {
  name: "pipe1"
  type: "PipelineConvPool"
  bottom: "data"
  top: "pipe1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
  }
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
