name: "nin_imagenet"
layer {
  top: "data"
  top: "label"
  name: "data"
  type: "Data"
  data_param {
    source: "examples/imagenet/ilsvrc12_train_lmdb"
    backend: LMDB
    batch_size: 256 
  }
  transform_param {
    crop_size: 224
    mirror: true
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
  }
  include: { phase: TRAIN }
}
layer {
  top: "data"
  top: "label"
  name: "data"
  type: "Data"
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    backend: LMDB
    batch_size: 256
  }
  transform_param {
    crop_size: 224
    mirror: false
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
  }
  include: { phase: TEST }
}
layer {
  name: "PROGRAM3"
  type: "XCLProgram"
  xcl_param {
    xcl_name: "crp_layer_hwcn_cpfp.xclbin"
    kernel_name: "crp_layer_hwcn_cpfp"
    once: true
  }
}
layer {
  name: "HWCN1"
  type: "HWCN"
  bottom: "data"
  top: "hwcn1"
  hwcn_param {
    convert_to: true
  }
}
layer {
  name: "PAD1"
  type: "Pad"
  bottom: "hwcn1"
  top: "pad1"
  pad_param {
    pad: true
    axis: 2 
    pad_to: 4 
  }
}
layer {
  name: "CPFP1"
  type: "CPFPConversion"
  bottom: "pad1"
  top: "cpfp1"
  cpfp_conversion_param {
    convert_to: true
  }
}
layer {
  bottom: "cpfp1"
  top: "conv1"
  name: "conv1_4c"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "conv1"
  top: "cccp1"
  name: "cccp1"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "cccp1"
  top: "cccp2"
  name: "cccp2"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "cccp2"
  top: "pool0"
  name: "pool0"
  type: "OCLPoolingHWCN"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool0"
  top: "conv2"
  name: "conv2"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "conv2"
  top: "cccp3"
  name: "cccp3"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "cccp3"
  top: "cccp4"
  name: "cccp4"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "cccp4"
  top: "pool2"
  name: "pool2"
  type: "OCLPoolingHWCN"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3"
  name: "conv3"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "conv3"
  top: "cccp5"
  name: "cccp5"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "cccp5"
  top: "cccp6"
  name: "cccp6"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "cccp6"
  top: "pool3"
  name: "pool3"
  type: "OCLPoolingHWCN"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4"
  name: "conv4-1024"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "conv4"
  top: "cccp7"
  name: "cccp7-1024"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  bottom: "cccp7"
  top: "cccp8"
  name: "cccp8-1024"
  type: "OCLCRHWCN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1000
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  cr_param {
    relu: 1 
    num_cu: 16
    num_pe: 4
  }
}
layer {
  name: "CPFP2"
  type: "CPFPConversion"
  bottom: "cccp8"
  top: "cpfp2"
  cpfp_conversion_param {
    convert_to: false
  }
}
layer {
  name: "HWCN2"
  type: "HWCN"
  bottom: "cpfp2"
  top: "hwcn2"
  hwcn_param {
    convert_to: false
  }
}
layer {
  bottom: "hwcn2"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 6
    stride: 1
  }
}
layer {
  name: "accuracy"
  type: "Accuracy" 
  bottom: "pool4"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}
layer {
  name: "accuracy_top_5"
  type: "Accuracy"
  bottom: "pool4"
  bottom: "label"
  top: "accuracy_top_5"
  accuracy_param {
    top_k: 5
  }
  include {
    phase: TEST
  }
} 
layer {
  bottom: "pool4"
  bottom: "label"
  name: "loss"
  type: "SoftmaxWithLoss" 
  include: { phase: TRAIN }
}
